In [2]:
import pandas as pd

In [38]:
titles = pd.read_csv('/home/bk/Desktop/mlai/Notes/Day 16-17/Dataset for Pandas Assinment/titles.csv')
cast = pd.read_csv('/home/bk/Desktop/mlai/Notes/Day 16-17/Dataset for Pandas Assinment/cast.csv')
release_dates = pd.read_csv('/home/bk/Desktop/mlai/Notes/Day 16-17/Dataset for Pandas Assinment/release_dates.csv')

In [40]:
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [41]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [42]:
release_dates.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

### How many movies are listed in the titles dataframe?

In [6]:
titles.shape[0]

244914

### What are the earliest two films listed in the titles dataframe?

In [21]:
titles.sort_values(by='year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [17]:
titles[titles['title']=='Hamlet'].count()

title    20
year     20
dtype: int64

### How many movies are titled "North by Northwest"?

In [18]:
titles[titles['title']=='North by Northwest'].count()

title    1
year     1
dtype: int64

### When was the first movie titled "Hamlet" made?

In [20]:
titles[titles['title']=='Hamlet'].sort_values(by='year').head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [37]:
titles[titles['title']=='Treasure Island'].sort_values(by='year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [24]:
titles[titles['year']==1950].count()

title    1113
year     1113
dtype: int64

### How many movies were made in the year 1960?

In [25]:
titles[titles['year']==1960].count()

title    1549
year     1549
dtype: int64

### How many movies were made from 1950 through 1959?

In [30]:
titles[(titles['year']>=1950) & (titles['year']<=1959)].count()

title    12934
year     12934
dtype: int64

### In what years has a movie titled "Batman" been released?

In [34]:
titles[titles['title']=='Batman']['year']

39349     1943
240896    1989
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [43]:
cast[cast['title'] == 'Inception']['type'].count()

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [44]:
cast[cast['title'] == 'Inception']['n'].isnull().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [45]:
cast[cast['title'] == 'Inception']['n'].notnull().sum()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [68]:
cast[(cast['title'] == 'North by Northwest') & (cast.n.notnull())].sort_values(by=['n'])[['name','n']]

                         name     n
871426             Cary Grant   1.0
3518333       Eva Marie Saint   2.0
1457165           James Mason   3.0
3157232   Jessie Royce Landis   4.0
356707         Leo G. Carroll   5.0
3048272  Josephine Hutchinson   6.0
1695173           Philip Ober   7.0
1275337         Martin Landau   8.0
2447081         Adam Williams   9.0
1811387          Edward Platt  10.0
665768      Robert Ellenstein  11.0
2295714          Les Tremayne  12.0
464736        Philip Coolidge  13.0
1508344         Patrick McVey  14.0
206471           Edward Binns  15.0
1384780             Ken Lynch  16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [73]:
cast[(cast['title'] == 'Sleuth') & (cast['year']==1972)].sort_values(by=['n'])[['name','n']]

                       name    n
1705394    Laurence Olivier  1.0
326773        Michael Caine  2.0
373876       Alec Cawthorne  3.0
1465483  John (II) Matthews  4.0
2724553  Eve (III) Channing  5.0
1448690        Teddy Martin  6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [74]:
cast[(cast['title'] == 'Sleuth') & (cast['year']==2007)].sort_values(by=['n'])[['name','n']]

                        name    n
326774         Michael Caine  1.0
1293634             Jude Law  2.0
1805907        Harold Pinter  3.0
260242       Kenneth Branagh  NaN
373877   Alec (II) Cawthorne  NaN
2724552    Eve (II) Channing  NaN
3370424    Carmel O'Sullivan  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [63]:
cast.loc[(cast['title']=='Hamlet') & (cast['year']==1921)]['character'].count()

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [62]:
cast.loc[(cast['title']=='Hamlet') & (cast['year']==1996)]['character'].count()

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [61]:
cast[cast['title'] == 'Hamlet']['character'].count()

342

### How many people have played an "Ophelia"?

In [59]:
cast[cast['character'] == 'Ophelia']['name'].count()

117

### How many people have played a role called "The Dude"?

In [58]:
cast[cast['character'] == 'The Dude']['name'].count()

19

### How many people have played a role called "The Stranger"?

In [57]:
cast[cast['character'] == 'The Stranger']['name'].count()

212

### How many roles has Sidney Poitier played throughout his career?

In [56]:
cast[cast['name'] == "Sidney Poitier"]['character'].count()

43

### How many roles has Judi Dench played?

In [55]:
cast[cast['name'] == "Judi Dench"]['character'].count()

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [54]:
cast[(cast['name'] == "Cary Grant") & (cast['n'] == ) & (cast['year'] >= 1940) & (cast['year'] < 1950)].sort_values(by = ['year'])[['character','year']]

          character  year
871423   Nick Arden  1940
871433  Roger Adams  1941

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [53]:
cast[(cast['name'] == "Cary Grant") & (cast['n'] == 1) & (cast['year'] >= 1940) & (cast['year'] < 1950)].sort_values(by = ['year'])[['character','year']]

                                   character  year
871448                           Matt Howard  1940
871407                          Walter Burns  1940
871450                    C. K. Dexter Haven  1940
871438                      Johnnie Aysgarth  1941
871452                          Leopold Dilg  1942
871429                 Patrick 'Pat' O'Toole  1942
871398                         Capt. Cassidy  1943
871422  Joe Adams -posing as Joe Bascopolous  1943
871430                           Jerry Flynn  1944
871390                     Mortimer Brewster  1944
871425                            Ernie Mott  1944
871424                           Cole Porter  1946
871427                                Devlin  1946
871444                           Dick Nugent  1947
871445                                Dudley  1947
871421                         Jim Blandings  1948
871402                     Dr. Madison Brown  1948
871411                 Captain Henri Rochard  1949

### How many roles were available for actors in the 1950s?

In [50]:
cast[(cast['year'] >= 1950) & (cast['year'] < 1960) & (cast['type'] == 'actor')]['character'].count()

157738

### How many roles were available for actresses in the 1950s?

In [49]:
cast[(cast['year'] >= 1950) & (cast['year'] < 1960) & (cast['type'] == 'actress')]['character'].count()

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [48]:
cast[(cast['year'] >= 1894) & (cast['year'] <= 1980) & (cast['n'] == 1)]['character'].count()

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [47]:
cast[(cast['year'] >= 1894) & (cast['year'] <= 1980) & (cast['n'] > 1)]['character'].count()

669320

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [46]:
cast[(cast['year'] >= 1894) & (cast['year'] <= 1980)]['n'].isnull().sum()

448347